apis_marvi/app/Controllers/Historial.php

    public function updateReading()
    {
        try {
            $json = $this->request->getJSON();
            $id_lectura = $json->id_lectura ?? null;
            if (!$id_lectura) return $this->fail('ID de lectura no proporcionado');

            // Soporte para FormData (para archivos) o JSON
            $id_lectura   = $this->request->getPost('id_lectura') ?? null;
            $lectura_fin  = $this->request->getPost('lectura_fin') ?? null;
            $cargos_add   = $this->request->getPost('cargos_add') ?? 0;
            $ajuste       = $this->request->getPost('ajuste') ?? 0;
            $nota         = $this->request->getPost('nota') ?? null;
            $total_manual = $this->request->getPost('total_a_pagar') ?? null;

            if (!$id_lectura) {
                $json = $this->request->getJSON();
                if ($json) {
                    $id_lectura   = $json->id_lectura ?? null;
                    $lectura_fin  = $json->lectura_fin ?? null;
                    $cargos_add   = $json->cargos_add ?? 0;
                    $ajuste       = $json->ajuste ?? 0;
                    $nota         = $json->nota ?? null;
                    $total_manual = $json->total_a_pagar ?? null;
                }
            }

            if (!$id_lectura) return $this->fail('ID de lectura es requerido');

            // 1. Obtener la lectura actual y configuración del edificio
            $lectura = $this->lecturaModel->find($id_lectura);
---
SELECT *
FROM `lectura`
WHERE `lectura`.`id_lectura` = '80929'