apis_marvi/app/Models/Cortes.php

    public function getActiveFullRow()
    {
        $row = $this->where('status', 1)->orderBy('id_corte', 'DESC')->first();
---
SELECT *
FROM `cortes`
WHERE `status` = 1
ORDER BY `id_corte` DESC
 LIMIT 1