apis_marvi/app/Models/Departamentos.php

    public function listByBuilding($id_edificio)
    {
        return $this->where('id_edificio', $id_edificio)
                    ->orderBy('num_departamento', 'ASC')
                    ->findAll();
---
SELECT *
FROM `departamentos`
WHERE `id_edificio` = '146'
ORDER BY `num_departamento` ASC