apis_marvi/app/Models/Lectura.php

    public function addNota($id_lectura, $texto)
    {
        $lectura = $this->find($id_lectura);
        if (!$lectura) return false;

        $notas = json_decode($lectura['nota'] ?? '[]', true);
        if (!is_array($notas)) $notas = [];

        $notas[] = [
            'text' => $texto,
            'date' => date('Y-m-d H:i:s'),
            'user' => 'Admin' // Valor por defecto solicitado
        ];

        return $this->update($id_lectura, ['nota' => json_encode($notas)]);
---
SELECT *
FROM `lectura`
WHERE `lectura`.`id_lectura` = 80936
UPDATE `lectura` SET `nota` = '[{\"text\":\"primer nota\",\"date\":\"2026-05-05 23:08:49\",\"user\":\"Admin\"},{\"text\":\"segund nota\",\"date\":\"2026-05-05 23:09:04\",\"user\":\"Admin\"}]'
WHERE `lectura`.`id_lectura` IN (80936)