apis_marvi/app/Models/Movimientos.php

    public function getMovimientosConPeriodo($id_departamento)
    {
        return $this->select('movimientos.*, COALESCE(lectura.periodo, "Ajuste Manual") as periodo_nombre')
                    ->join('lectura', 'movimientos.referencia_id = lectura.id_lectura AND movimientos.referencia_tipo = \'lectura\'', 'left')
                    ->where('movimientos.id_departamento', $id_departamento)
                    ->orderBy('movimientos.fecha', 'DESC')
                    ->orderBy('movimientos.id_movimiento', 'DESC')
                    ->findAll();
---
SELECT `movimientos`.*, COALESCE(lectura.periodo, "Ajuste Manual") as periodo_nombre
FROM `movimientos`
LEFT JOIN `lectura` ON `movimientos`.`referencia_id` = `lectura`.`id_lectura` AND `movimientos`.`referencia_tipo` = 'lectura'
WHERE `movimientos`.`id_departamento` = '493'
ORDER BY `movimientos`.`fecha` DESC, `movimientos`.`id_movimiento` DESC